## Pandas

In [4]:
## Importing
import pandas as pd

In [5]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [6]:
len(dir(pd))

141

In [8]:
# Version checking:
pd.__version__

'1.0.1'

## Series :

* The data will be created in the format of 1D
* The output of this series will be row wise

In [9]:
## Creating the series objects:

a = pd.Series([1,2,3,4,5])

In [10]:
a

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
## Creating data using numpy in Series format
import numpy as np

a = pd.Series(np.array([2,3,4,5,1]))
a

0    2
1    3
2    4
3    5
4    1
dtype: int32

In [16]:
## Creating series using tuple:

t = pd.Series((1,2,3,4))
t

0    1
1    2
2    3
3    4
dtype: int64

In [17]:
## Creating Series using Dictionaries:

di = {'a':10,'b':20,'c':30,'d':40}
d = pd.Series(di)
d

a    10
b    20
c    30
d    40
dtype: int64

In [19]:
a = pd.Series([1,2,3,4],index = ['aa','bb','cc','dd'])
a

aa    1
bb    2
cc    3
dd    4
dtype: int64

In [22]:
a = [3,4,5,6,1,2]
b = pd.Series(a,index = np.arange(len(a))) # takes index numbers from 0 to len a
b

0    3
1    4
2    5
3    6
4    1
5    2
dtype: int64

In [23]:
b.dtype

dtype('int64')

## DataFrames

In [24]:
a = pd.DataFrame([1,2,3,4])
a

   0
0  1
1  2
2  3
3  4

In [27]:
### Creating multiple columns :

a = pd.DataFrame([[1,"two",3,"four"],[4,"Five",6,7],["eight","nine",10,1]])
a

       0     1   2     3
0      1   two   3  four
1      4  Five   6     7
2  eight  nine  10     1

In [28]:
a = pd.DataFrame([[1,"two",3,"four"],[4,"Five",6,7],["eight","nine",10,1]], columns = ["a","b","c","d"])
a

       a     b   c     d
0      1   two   3  four
1      4  Five   6     7
2  eight  nine  10     1

In [29]:
a.index = [1,2,3]

In [30]:
a

       a     b   c     d
1      1   two   3  four
2      4  Five   6     7
3  eight  nine  10     1

In [33]:
## Creating Data Frames using Dictionary
d = {"Name":["siri","sindhu","gireesha"],
    "Age":[21,20,24],
    "Year":[2020,2021,2022]}
a = pd.DataFrame(d,index = [1,2,3])

In [34]:
a

       Name  Age  Year
1      siri   21  2020
2    sindhu   20  2021
3  gireesha   24  2022

In [36]:
## Creating dataframe using multiple dictionaries:

data = [{'a':1,'b':2,'c':3},
       {'a':4,'b':6,'cd':8}]
a = pd.DataFrame(data)
a

   a  b    c   cd
0  1  2  3.0  NaN
1  4  6  NaN  8.0

In [67]:
## Converting Series into DataFrame:

d = {"one":pd.Series([1,2,3,4]),
    "two":pd.Series([4,5,6,7]),
    "four":pd.Series([6,0])}
a = pd.DataFrame(d)

In [68]:
a

   one  two  four
0    1    4   6.0
1    2    5   0.0
2    3    6   NaN
3    4    7   NaN

In [69]:
#a = pd.DataFrame(d,dtype = complex)
a

   one  two  four
0    1    4   6.0
1    2    5   0.0
2    3    6   NaN
3    4    7   NaN

## Slicing and Indexing

In [70]:
## Series Indexing:

s2 = pd.Series([34,56,65,24,67,78.12])
s2

0    34.00
1    56.00
2    65.00
3    24.00
4    67.00
5    78.12
dtype: float64

In [71]:
s2.index = ["a","e",2,"o",6,"u"]

In [72]:
s2

a    34.00
e    56.00
2    65.00
o    24.00
6    67.00
u    78.12
dtype: float64

In [73]:
s2[2]
s2['u']
s2[2:5] # implicit indexing
s2['o':'u'] # explicit indexing

o    24.00
6    67.00
u    78.12
dtype: float64

In [74]:
s2[-1:]

u    78.12
dtype: float64

In [75]:
# Fancy slicing
s2[['a','o',6]]

a    34.0
o    24.0
6    67.0
dtype: float64

In [76]:
a

   one  two  four
0    1    4   6.0
1    2    5   0.0
2    3    6   NaN
3    4    7   NaN

In [77]:
a.values

array([[ 1.,  4.,  6.],
       [ 2.,  5.,  0.],
       [ 3.,  6., nan],
       [ 4.,  7., nan]])

In [78]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [79]:
a["four"]

0    6.0
1    0.0
2    NaN
3    NaN
Name: four, dtype: float64

In [80]:
a["two"][3]

7

In [81]:
a[-1:]

   one  two  four
3    4    7   NaN

In [82]:
a[1:]

   one  two  four
1    2    5   0.0
2    3    6   NaN
3    4    7   NaN

In [83]:
a.head(1) # only head() will gives us first 5 rows values

   one  two  four
0    1    4   6.0

In [85]:
a.tail(1) # tail() will gives us last 5 rows

   one  two  four
3    4    7   NaN

In [86]:
a.columns

Index(['one', 'two', 'four'], dtype='object')

## iloc and loc:

In [89]:
a = pd.DataFrame([[1,2,3,4,5],[6,7,8,9,0]],columns = ["python","java","c","c++","oracle"],index = [1,'v'])

In [90]:
a

   python  java  c  c++  oracle
1       1     2  3    4       5
v       6     7  8    9       0

In [97]:
a.iloc[1]

python    6
java      7
c         8
c++       9
oracle    0
Name: v, dtype: int64

In [100]:
a.loc['v']

python    6
java      7
c         8
c++       9
oracle    0
Name: v, dtype: int64

## Date range/Series

In [102]:
s = pd.date_range(start = "2020-11-27",end = "2020-12-05")
s

DatetimeIndex(['2020-11-27', '2020-11-28', '2020-11-29', '2020-11-30',
               '2020-12-01', '2020-12-02', '2020-12-03', '2020-12-04',
               '2020-12-05'],
              dtype='datetime64[ns]', freq='D')

In [103]:
pd.date_range(start = '2018-04-06',end = '2018-04-10',periods = 4)

DatetimeIndex(['2018-04-06 00:00:00', '2018-04-07 08:00:00',
               '2018-04-08 16:00:00', '2018-04-10 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [105]:
pd.date_range(start = '1/1/2018',periods = 5,freq = '3M')

DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
               '2019-01-31'],
              dtype='datetime64[ns]', freq='3M')

In [106]:
a

   python  java  c  c++  oracle
1       1     2  3    4       5
v       6     7  8    9       0

In [107]:
del a["oracle"]

In [108]:
a

   python  java  c  c++
1       1     2  3    4
v       6     7  8    9

In [109]:
a.isnull()

   python   java      c    c++
1   False  False  False  False
v   False  False  False  False

In [110]:
a.notnull()

   python  java     c   c++
1    True  True  True  True
v    True  True  True  True

## Combining and merging od dataframes:

In [111]:
a = {"name":['sindhu','siri','sumathi'],
    "Branch":['CSE','ECE','EEE'],
    "Gender":['F','M','F']}
a = pd.DataFrame(a,index = [101,102,103])

In [112]:
a

        name Branch Gender
101   sindhu    CSE      F
102     siri    ECE      M
103  sumathi    EEE      F

In [113]:
pd.concat([a,a]) # rwo wise concatination

        name Branch Gender
101   sindhu    CSE      F
102     siri    ECE      M
103  sumathi    EEE      F
101   sindhu    CSE      F
102     siri    ECE      M
103  sumathi    EEE      F

In [117]:
pd.concat([a,a],axis = 1) # columns wise concatination

        name Branch Gender     name Branch Gender
101   sindhu    CSE      F   sindhu    CSE      F
102     siri    ECE      M     siri    ECE      M
103  sumathi    EEE      F  sumathi    EEE      F

In [118]:
a.append(a) ## row wise appending

        name Branch Gender
101   sindhu    CSE      F
102     siri    ECE      M
103  sumathi    EEE      F
101   sindhu    CSE      F
102     siri    ECE      M
103  sumathi    EEE      F

In [119]:
pd.merge(a,a)

      name Branch Gender
0   sindhu    CSE      F
1     siri    ECE      M
2  sumathi    EEE      F

In [120]:
d1 = pd.DataFrame({"std_name":['r','b','v','t'],
                  "age":[6,7,8,9]})
d1

  std_name  age
0        r    6
1        b    7
2        v    8
3        t    9

In [121]:
d2 = pd.DataFrame({'std_name':['r','a','b','z'],
                  "fav_food":["chicken","fish","mutton","tiger rice"]})
d2

  std_name    fav_food
0        r     chicken
1        a        fish
2        b      mutton
3        z  tiger rice

In [123]:
pd.merge(d1,d2)

  std_name  age fav_food
0        r    6  chicken
1        b    7   mutton

In [125]:
pd.concat([d1,d2])

  std_name  age    fav_food
0        r  6.0         NaN
1        b  7.0         NaN
2        v  8.0         NaN
3        t  9.0         NaN
0        r  NaN     chicken
1        a  NaN        fish
2        b  NaN      mutton
3        z  NaN  tiger rice

In [126]:
pd.merge(d1,d2,how = 'left')

  std_name  age fav_food
0        r    6  chicken
1        b    7   mutton
2        v    8      NaN
3        t    9      NaN

In [127]:
pd.merge(d1,d2,how = "right")

  std_name  age    fav_food
0        r  6.0     chicken
1        b  7.0      mutton
2        a  NaN        fish
3        z  NaN  tiger rice

In [128]:
pd.merge(d1,d2,how = "outer") # like Union

  std_name  age    fav_food
0        r  6.0     chicken
1        b  7.0      mutton
2        v  8.0         NaN
3        t  9.0         NaN
4        a  NaN        fish
5        z  NaN  tiger rice

In [129]:
pd.merge(d1,d2,how = "inner") # like intersection

  std_name  age fav_food
0        r    6  chicken
1        b    7   mutton

## File Reading:

In [130]:
data = pd.read_csv("birds.csv") # reading csv file

In [131]:
data.head() # first 5 rows

   id   huml  humw  ulnal  ulnaw   feml  femw   tibl  tibw   tarl  tarw type
0   0  80.78  6.68  72.01   4.88  41.81  3.70   5.50  4.03  38.70  3.84   SW
1   1  88.91  6.63  80.53   5.59  47.04  4.30  80.22  4.51  41.50  4.01   SW
2   2  79.97  6.37  69.26   5.28  43.07  3.90  75.35  4.04  38.31  3.34   SW
3   3  77.65  5.70  65.76   4.77  40.04  3.52  69.17  3.40  35.78  3.41   SW
4   4  62.80  4.84  52.09   3.73  33.95  2.72  56.27  2.96  31.88  3.13   SW

In [132]:
data.tail(3) # last 3 rows

,id,huml,humw,ulnal,ulnaw,feml,femw,tibl,tibw,tarl,tarw,type
417,417,18.79,1.63,19.83,1.53,20.96,1.43,34.45,1.41,22.86,1.21,SO
418,418,20.38,1.78,22.53,1.50,21.35,1.48,36.09,1.53,25.98,1.24,SO
419,419,17.89,1.44,19.26,1.10,17.62,1.34,29.81,1.24,21.69,1.05,SO